## Pandas

### 2차원 : DataFrame

In [1]:
import numpy as np
import pandas as pd

In [51]:
d = [1, 2, 3, 4, 5]
df = pd.DataFrame(d)
df

   0
0  1
1  2
2  3
3  4
4  5

In [52]:
ps = pd.Series(d)
ps

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [53]:
#간략하게 df에서 핸들링을 해보자
#pandas의 DataFrame에서 
#가로줄 인덱스 :index
#세로줄 인덱스 : columns

In [54]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [55]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [57]:
df.columns = ["col1"] #간단하게 컬럼 이름 부여 (FM적인 방식 X)
df

   col1
0     1
1     2
2     3
3     4
4     5

In [58]:
#앞으로 편히 자주 사용하는 것이
#  -> 기존의 df가 있는 상태에서 컬럼 추가

In [59]:
df["newCol"] = d #없는 column은 만들어서 추가
df

   col1  newCol
0     1       1
1     2       2
2     3       3
3     4       4
4     5       5

In [60]:
df["newCol"] = 5 #기존에 있는 column은 안에 있는 원소에 할당
df

   col1  newCol
0     1       5
1     2       5
2     3       5
3     4       5
4     5       5

In [61]:
df["newCol"]

0    5
1    5
2    5
3    5
4    5
Name: newCol, dtype: int64

In [62]:
df

   col1  newCol
0     1       5
1     2       5
2     3       5
3     4       5
4     5       5

In [64]:
df["new1"] = df["col1"]*100
df

   col1  newCol  new1
0     1       5   100
1     2       5   200
2     3       5   300
3     4       5   400
4     5       5   500

In [67]:
#Q) 기존의 df에서 col1의 값과 newCol1의 값을 합하여 새로운 new2라는 컬럼을 만들어보세요
df["new2"] = df["col1"] + df["newCol"]
df

   col1  newCol  new1  new2
0     1       5   100     6
1     2       5   200     7
2     3       5   300     8
3     4       5   400     9
4     5       5   500    10

In [66]:
#기존의 컬럼의 값을 처리를 하여서 제거를 해야할 때
#아니면 불필요한 컬럼을 제거하고자 할 때

In [68]:
#방법1) del함수 이용
del df["new2"] #다이렉트로 지우기
df

   col1  newCol  new1
0     1       5   100
1     2       5   200
2     3       5   300
3     4       5   400
4     5       5   500

In [69]:
#방법2) DF의 drop 메서드->원본 유지 
#        pandas에서 지울 떄는 drop을 사용하는데,
#        가로줄로 지울지 : axis =0
#        세로줄로 지울지 : axis = 1
df.drop("new1",axis = 1) #삭제된거 보여주기
df                       #원본은 건들이지 않음 -> 업데이트 필요

   col1  newCol  new1
0     1       5   100
1     2       5   200
2     3       5   300
3     4       5   400
4     5       5   500

In [70]:
#방법3) 내가 필요한 컬럼만 선택해서
df2 = df[["col1","newCol"]]
df2

   col1  newCol
0     1       5
1     2       5
2     3       5
3     4       5
4     5       5

In [71]:
df.drop(3, axis = 0)

   col1  newCol  new1
0     1       5   100
1     2       5   200
2     3       5   300
4     5       5   500

In [72]:
##이제 데이터를 만들어보자

In [2]:
stock_price_DF = pd.DataFrame(
                 data = [10000, 10300,9900, 10500, 11000],
                 index = ["2022-01-01","2022-01-02","2022-01-03","2022-01-04","2022-01-5"])
stock_price_DF

                0
2022-01-01  10000
2022-01-02  10300
2022-01-03   9900
2022-01-04  10500
2022-01-5   11000

In [79]:
#컬럼 이름 변경 -> 자주 사용됨
#에러가 없는 것이 아니라 진짜 변경이 되었는지 꼭 꼭 눈으로 확인 체크 필요!!
stock_price_DF.rename(columns = {0:"시가"},inplace=True)
stock_price_DF

               시가
2022-01-01  10000
2022-01-02  10300
2022-01-03   9900
2022-01-04  10500
2022-01-5   11000

In [80]:
#일단 DF가 1줄이라고 있는 상태애서 옆으로(컬럼 추가) 추가를 하고자 한다
#증가 컬럼 추가 : 11000, 12000, 10000, 13000 12000
#고가 컬럼 추가 : 13000, 15000, 15000, 18000, 17000
#저가 컬럼 추가 : 3000, 5000, 5000, 8000, 7000

In [4]:
stock_price_DF = pd.DataFrame(
                 data = [10000, 10300,9900, 10500, 11000],
                 index = ["2022-01-01","2022-01-02","2022-01-03","2022-01-04","2022-01-5"])
stock_price_DF.rename(columns = {0:"시가"},inplace=True)
stock_price_DF["종가"] = [11000, 12000, 10000, 13000, 12000]
stock_price_DF["고가"] = [13000, 15000, 15000, 18000, 17000 ]
stock_price_DF["저가"] = [ 3000, 5000, 5000, 8000, 7000]
stock_price_DF
#여기서 체크할 사항 : 기존 DF가 있다면
# DF[컬럼]으로 쉽게 컬럼에 대한 핸들링이 쉽다

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000
2022-01-04  10500  13000  18000  8000
2022-01-5   11000  12000  17000  7000

In [90]:
#Q) 컬럼 이름을 시가: S, 종가: E, 고가: H, 저가: L
stock_price_DF.rename(columns = {
    "시가" : "S", "종가" : "E", "고가":"H","저가":"L"
}, inplace = True)
stock_price_DF

                S      E      H     L
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000
2022-01-04  10500  13000  18000  8000
2022-01-5   11000  12000  17000  7000

In [91]:
#Q) 다시 원래의 컬럼 이름으로 복구
stock_price_DF.rename(columns = {
    "S" : "시가", "E" : "종가", "H":"고가","L":"저가"
}, inplace = True)
stock_price_DF

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000
2022-01-04  10500  13000  18000  8000
2022-01-5   11000  12000  17000  7000

In [106]:
#Q) stock_price_DF.iat[0]은 왜 에러가 나타날까?
stock_price_DF.iat[0,0] #2차원이라 인덱스가 두 개 필요하다
#명확하게 가로, 세로의 정보로 1개의 포인트에 접근

10000

In [111]:
#Q) 2022년 1월 3일의 시가와 종가는?
stock_price_DF.loc["2022-01-03",["시가","종가"]]

시가     9900
종가    10000
Name: 2022-01-03, dtype: int64

In [115]:
#Q) 2022년 1월 1일부터 1월 3일의 시가/종가/고가/저가는?
stock_price_DF.loc["2022-01-01":"2022-01-03",:] #슬라이싱은 리스트로 묶지 않아도 됨

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000

In [116]:
#Q) 2022년 1월 3일 시가는 얼마?
stock_price_DF.iat[2,0]

9900

In [117]:
#Q) 2022년 1월 3일 , 1월 5일의 시가와 종가?
stock_price_DF.loc[["2022-01-03","2022-01-5"],["시가","종가"]]

               시가     종가
2022-01-03   9900  10000
2022-01-5   11000  12000

In [118]:
#Q) 시가와 저가만 보려면?
stock_price_DF.loc[:,["시가","종가"]]

               시가     종가
2022-01-01  10000  11000
2022-01-02  10300  12000
2022-01-03   9900  10000
2022-01-04  10500  13000
2022-01-5   11000  12000

In [119]:
#참고) 
type(stock_price_DF["시가"])

pandas.core.series.Series

In [120]:
stock_price_DF["시가"]["2022-01-01"] #search기반으로 하기 때문에 속도가 느림

10000

In [121]:
## 기타 기능

In [122]:
stock_price_DF.T #가로축, 세로축 뒤집음

    2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-5
시가       10000       10300        9900       10500      11000
종가       11000       12000       10000       13000      12000
고가       13000       15000       15000       18000      17000
저가        3000        5000        5000        8000       7000

In [124]:
stock_price_DF.shape

(5, 4)

In [125]:
stock_price_DF.shape[0] #열의 개수

5

In [127]:
stock_price_DF.shape[1] #행의 개수

4

In [128]:
len(stock_price_DF) #가로줄(열)만 기준으로 보여줌

5

In [129]:
stock_price_DF.size

20

In [130]:
##인덱스에 대하여

In [132]:
stock_price_DF.reindex(["2022-01-01","2021-01-02"], fill_value =10 ) #가로줄에 대한 내가 보고자 하는 데이터로 재세팅
                                                   # NaN 없는 값들 10으로 채우기

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2021-01-02      0      0      0     0

In [133]:
## 중간에 누락된 값을 채우는 방법 중 하나 : 보간법

In [134]:
test = pd.DataFrame([4.5, 7.2, -5.3], index = ["c","b","a"])
test

     0
c  4.5
b  7.2
a -5.3

In [136]:
test = test.reindex(["a","b","e","c","d"])
test

     0
a -5.3
b  7.2
e  NaN
c  4.5
d  NaN

In [137]:
test.iloc[:,0].interpolate() #간격을 동일하게 나눠서 없던 값들을 채움

a   -5.30
b    7.20
e    5.85
c    4.50
d    4.50
Name: 0, dtype: float64

In [138]:
test["adj"] = test.iloc[:,0].interpolate()
test

     0   adj
a -5.3 -5.30
b  7.2  7.20
e  NaN  5.85
c  4.5  4.50
d  NaN  4.50

In [140]:
test = test.reindex(["f","a","d","e","c","b"])
test

     0   adj
f  NaN   NaN
a -5.3 -5.30
d  NaN  4.50
e  NaN  5.85
c  4.5  4.50
b  7.2  7.20

In [141]:
test.interpolate() # 두 사이로 기준을 잡기 때문에 맨 처음이나 맨 뒤는 하나의 포인트밖에 없기 때문에 채울 수 없음
#단순히 기계적으로 적용하면 안됨
#꼭 직접 데이터가 변형이 되었는지 체크!

          0   adj
f       NaN   NaN
a -5.300000 -5.30
d -2.033333  4.50
e  1.233333  5.85
c  4.500000  4.50
b  7.200000  7.20

In [142]:
##정렬
# pandas는 기본적인 구성이 인덱스 + 값
#  -> 정렬 기준도 인덱스 + 값
#     여기서 df는 2차원이여서 인덱스로 할 때 가로인덱스? 세로인덱스? -> drop처름 axis로 선택!

In [144]:
stock_price_DF.sort_index(axis = 1, ascending=True)

               고가     시가    저가     종가
2022-01-01  13000  10000  3000  11000
2022-01-02  15000  10300  5000  12000
2022-01-03  15000   9900  5000  10000
2022-01-04  18000  10500  8000  13000
2022-01-5   17000  11000  7000  12000

In [145]:
stock_price_DF.sort_index(axis = 1, ascending=False)

               종가    저가     시가     고가
2022-01-01  11000  3000  10000  13000
2022-01-02  12000  5000  10300  15000
2022-01-03  10000  5000   9900  15000
2022-01-04  13000  8000  10500  18000
2022-01-5   12000  7000  11000  17000

In [146]:
stock_price_DF.sort_index(axis = 0, ascending=False)

               시가     종가     고가    저가
2022-01-5   11000  12000  17000  7000
2022-01-04  10500  13000  18000  8000
2022-01-03   9900  10000  15000  5000
2022-01-02  10300  12000  15000  5000
2022-01-01  10000  11000  13000  3000

In [147]:
#Q) 가로줄은 최근 날짜를 맨 앞으로 세로줄은 컬렴명 (ㄱ -> ㅎ)순서대로 정렬해서 보고자 한다
stock_price_DF.sort_index(axis = 0, ascending=False).sort_index(axis = 1, ascending = True)

               고가     시가    저가     종가
2022-01-5   17000  11000  7000  12000
2022-01-04  18000  10500  8000  13000
2022-01-03  15000   9900  5000  10000
2022-01-02  15000  10300  5000  12000
2022-01-01  13000  10000  3000  11000

In [148]:
## 인덱스(가로, 세로)가 아니라 값 자체를 기준으로 정렬

In [149]:
stock_price_DF.sort_values(by = "고가")

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000
2022-01-5   11000  12000  17000  7000
2022-01-04  10500  13000  18000  8000

In [150]:
stock_price_DF.sort_values(by = ["고가","시가"]) #"고가" 기준이 동일하다면 "시가" 기준으로

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-03   9900  10000  15000  5000
2022-01-02  10300  12000  15000  5000
2022-01-5   11000  12000  17000  7000
2022-01-04  10500  13000  18000  8000

In [151]:
stock_price_DF["종가"].rank() #오름차순 순위 매기기

2022-01-01    2.0
2022-01-02    3.5
2022-01-03    1.0
2022-01-04    5.0
2022-01-5     3.5
Name: 종가, dtype: float64

In [152]:
stock_price_DF["종가"].rank(method = "max")

2022-01-01    2.0
2022-01-02    4.0
2022-01-03    1.0
2022-01-04    5.0
2022-01-5     4.0
Name: 종가, dtype: float64

In [153]:
stock_price_DF["종가"].rank(method = "max", ascending=False) #내림차순

2022-01-01    4.0
2022-01-02    3.0
2022-01-03    5.0
2022-01-04    1.0
2022-01-5     3.0
Name: 종가, dtype: float64

### 줄 단위 일괄 처리 apply & lambda ... 중요!!

In [154]:
stock_price_DF

               시가     종가     고가    저가
2022-01-01  10000  11000  13000  3000
2022-01-02  10300  12000  15000  5000
2022-01-03   9900  10000  15000  5000
2022-01-04  10500  13000  18000  8000
2022-01-5   11000  12000  17000  7000

In [156]:
#날짜 별로 그 날짜의 여러 값 중에서 max - min의 차이를 알고자한다
stock_price_DF.apply(lambda x : x.max() - x.min(), axis = 1)

2022-01-01    10000
2022-01-02    10000
2022-01-03    10000
2022-01-04    10000
2022-01-5     10000
dtype: int64

In [157]:
stock_price_DF.apply(lambda x : x.max() - x.min(), axis = 0)

시가    1100
종가    3000
고가    5000
저가    5000
dtype: int64

In [159]:
stock_price_DF.applymap(lambda x : x + 5)

               시가     종가     고가    저가
2022-01-01  10005  11005  13005  3005
2022-01-02  10305  12005  15005  5005
2022-01-03   9905  10005  15005  5005
2022-01-04  10505  13005  18005  8005
2022-01-5   11005  12005  17005  7005

In [161]:
#Q) 기존의 DF에서, 날짜별로 최고가격과 최저가격의 차이를 계산해서 그 값을 새로운 "Gap"컬럼에 만들어보세요
stock_price_DF["Gap"] = stock_price_DF.apply(lambda x : x.max() - x.min(), axis = 1)
stock_price_DF

               시가     종가     고가    저가    Gap
2022-01-01  10000  11000  13000  3000  10000
2022-01-02  10300  12000  15000  5000  10000
2022-01-03   9900  10000  15000  5000  10000
2022-01-04  10500  13000  18000  8000  10000
2022-01-5   11000  12000  17000  7000  10000

In [174]:
#Q) GapFor컬럼에는 동일한 기능인데, for문을 통해서 작업
GapFor = []
for i in range(stock_price_DF.shape[0]):
        GapFor.append(max(stock_price_DF.iloc[i,:]) - min(stock_price_DF.iloc[i,:]))
stock_price_DF["GapFor"] = GapFor 
stock_price_DF

               시가     종가     고가    저가    Gap  GapFor
2022-01-01  10000  11000  13000  3000  10000   10000
2022-01-02  10300  12000  15000  5000  10000   10000
2022-01-03   9900  10000  15000  5000  10000   10000
2022-01-04  10500  13000  18000  8000  10000   10000
2022-01-5   11000  12000  17000  7000  10000   10000

In [176]:
#A)
stock_price_DF["GapFor"] = 0
#기준 : 정수 인덱스
for i in range(0, len(stock_price_DF)):
    #가로 i번줄에서 앞의 4개의 값들 가져오기 : iloc
    data = stock_price_DF.iloc[i, :4]
    #4개의 값 중에서 max
    #4개의 값 중에서 min
    #이 값의 차이 temp
    temp = data.max() - data.min()
    #업데이트 할 위치: 가로줄 i, 세로줄 gapfor 컬럼줄 -> temp
    stock_price_DF.iat[i,5] = temp
stock_price_DF

               시가     종가     고가    저가    Gap  GapFor
2022-01-01  10000  11000  13000  3000  10000   10000
2022-01-02  10300  12000  15000  5000  10000   10000
2022-01-03   9900  10000  15000  5000  10000   10000
2022-01-04  10500  13000  18000  8000  10000   10000
2022-01-5   11000  12000  17000  7000  10000   10000

In [177]:
# 수정)
stock_price_DF["GapFor"] = 0
idx = stock_price_DF.columns.get_loc("GapFor") #내가 만든 인덱스 이름으로 정수 인덱스 위치 구하기

cols = ["시가","종가","고가","저가"]
cols_dix = [stock_price_DF.columns.get_loc(col) for col in cols] # 내가 원하는 컬럼이 흩어져 있는 경우

for i in range(stock_price_DF.shape[0]):
    data = stock_price_DF.iloc[i,cols_dix]
    temp = data.max() - data.min()
    stock_price_DF.iat[i,idx] = temp
stock_price_DF

               시가     종가     고가    저가    Gap  GapFor
2022-01-01  10000  11000  13000  3000  10000   10000
2022-01-02  10300  12000  15000  5000  10000   10000
2022-01-03   9900  10000  15000  5000  10000   10000
2022-01-04  10500  13000  18000  8000  10000   10000
2022-01-5   11000  12000  17000  7000  10000   10000

In [178]:
cols = ["시가","종가","고가","저가"]
cols_dix = [stock_price_DF.columns.get_loc(col) for col in cols]
cols_dix

[0, 1, 2, 3]

In [184]:
#Q) 위의 주어진 DF에서 시가의 1월 1일 ~ 1월 5일까지의 평균
#                      종가의 1월 1일 ~ 1월 5일까지의 평균
#                      고가, 저가에 대해서도 같이하면?
stock_price_DF.iloc[:,:4].apply(lambda x : x.mean(), axis = 0)  #전체 df가 아니라 iloc로 원하는 영역 추출하기

시가    10340.0
종가    11600.0
고가    15600.0
저가     5600.0
dtype: float64

In [187]:
#Q) 위의 주어진 DF에서 날짜별로 4개의(시,고,저,종)의 평균은?
stock_price_DF.iloc[:,:4].apply(lambda x : x.mean(), axis = 1)

2022-01-01     9250.0
2022-01-02    10575.0
2022-01-03     9975.0
2022-01-04    12375.0
2022-01-5     11750.0
dtype: float64

In [6]:
#간단한 수치 함수들
stock_price_DF["시가"].mean()

10340.0

In [8]:
stock_price_DF.mean()

시가    10340.0
종가    11600.0
고가    15600.0
저가     5600.0
dtype: float64

In [9]:
#분석하는 데이터를 불러놓고 종종 사용함 -> check용도
stock_price_DF.describe()

                 시가            종가            고가           저가
count      5.000000      5.000000      5.000000     5.000000
mean   10340.000000  11600.000000  15600.000000  5600.000000
std      439.317653   1140.175425   1949.358869  1949.358869
min     9900.000000  10000.000000  13000.000000  3000.000000
25%    10000.000000  11000.000000  15000.000000  5000.000000
50%    10300.000000  12000.000000  15000.000000  5000.000000
75%    10500.000000  12000.000000  17000.000000  7000.000000
max    11000.000000  13000.000000  18000.000000  8000.000000

In [11]:
#모델을 만들 때, 무슨 변수를 쓸까 제거할까 -> 가장 1차원적인 지표
stock_price_DF.corr()

          시가        종가        고가        저가
시가  1.000000  0.688761  0.723971  0.723971
종가  0.688761  1.000000  0.697378  0.697378
고가  0.723971  0.697378  1.000000  1.000000
저가  0.723971  0.697378  1.000000  1.000000

In [13]:
#값들이 유니크한지(중복된 것 없이) -> 데이터 전체가 아니라 지정해 줘야함
stock_price_DF["시가"].unique()

array([10000, 10300,  9900, 10500, 11000], dtype=int64)

In [14]:
len(stock_price_DF) == len(stock_price_DF["시가"].unique())

True

In [15]:
stock_price_DF["고가"].unique()

array([13000, 15000, 18000, 17000], dtype=int64)

In [18]:
len(stock_price_DF.index.unique())

5

In [19]:
## NaN 있는 데이터들 처리
    #1. 제거  : dropna
    #2. 채우기 : fillna -> apply, lambda
from numpy import nan as NA
data = pd.DataFrame(
        data = [[1, 6.5, 3],
                [1, NA, NA],
                [NA, NA, NA],
                [NA, 6.5, 3]]
)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
#제거하기

In [20]:
test_01 = data.dropna() #가로줄기준으로 완벽한 열만 남김 -> 빵구난 것은 전혀 존재하지 않음
test_01

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(axis = 0)

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
data.dropna(how = "all",axis = 0) #전체가 없는 경우만 없애줘 (빵구난 값이 기준)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.dropna(how = "all",axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data.dropna(thresh = 1, axis = 0) # 줄에 데이터 중에서 정상적인 값이 1개 이상인 것들을 살릴 때(정상적인 값이 기준)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.dropna(thresh = 2, axis = 0) #가로줄 기준으로 정상적인 값이 2개 이상인 경우

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [29]:
#채우기

In [30]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [31]:
#채우기는 하는데 1번 컬럼은 0으로 채우고 2번 컬럼은 99로 채우려면?
# -> 컬럼마다 다른 값으로 채우려고 할 때
data.fillna({1:0, 2:99})

     0    1     2
0  1.0  6.5   3.0
1  1.0  0.0  99.0
2  NaN  0.0  99.0
3  NaN  6.5   3.0

In [ ]:
#참고로 채울 때, 없는 값의 앞의 값으로 채우거나 / 뒤의 값으로 채우거나 / 앞뒤 선형보간법으로 채우거나
              #--> 이러한 것들은 method 옵션 찾아서~

#### pandas DataFrame 정리
* 1)DataFrame : 2차원 -> 인덱스가 가로, 세로 2개 -> 1개, 여러개 슬라이싱, 여러개 리스트, 기타..
* 2)pandas가 태생적으로 가지는 정수 인덱스 + 내가 만든 인덱스 -> 1)에서 모두 다 적용 가능                               
    -> 단, FM방법으로 하실 때는 정수 or 내가 만든거 중 1개 선택
* 3)FM적으로 접근하는 방법에 대해서                                                    
     -> 1개의 값 : at(가로,세로 다 내가 만든거) , iat(가로, 세로 다 정수로)
     ->여러개 값 : loc(가로,세로 다 내가 만든거) , iloc (가로, 세로 다 정수로)
* 4)DF[컬럼] : 간략하게 DF컬럼에 대한 정보 볼 때, DF[컬럼]에서 값을 변경, 컬럼 추가                         
             data["시가"] = [~~~]
             data["종가"] = data["시가"] + data["종가"]
            + 줄 단위 연산을 통해서 할 때 lambda apply로  
              data["gap"] = data.apply(lambda x : ~~~)
* 5)줄 단위에 대한 일괄적용 -> 전치 , 특징 생성, 변환 등... (ML)
    ->내가 줄 단위 할 때 필요한 정보들 생각
    ->줄을 가로줄이냐 세로줄이냐에 따라서 axis = 0,1로 설정
    ->무엇을 할지에 대해서 간략하면 lambda로 복잡하면 일반적인 함수 만들어서
* 6)numpy, pd.Series에 있던 여러가지 기타 연산들..max, mean,,